app/views/users/_current_user_reports.html.erb


<% @user.reports.each do |report| %>
---
SELECT "reports".* FROM "reports" WHERE "reports"."user_id" = $1  [["user_id", 1]]