app/views/users/_current_user_expenses.html.erb

SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = $1  [["user_id", 1]]
---
  <th>Date:</th>
  <% @user.expenses.each do |expense| %>