app/controllers/expenses_controller.rb

INSERT INTO "expenses" ("description", "amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "lunch with client"], ["amount", #<BigDecimal:7fc1ff4be420,'0.3E2',9(18)>], ["user_id", 1], ["created_at", 2017-04-29 05:01:00 UTC], ["updated_at", 2017-04-29 05:01:00 UTC]]
---
  def create
    expense = Expense.new(user_id: params[:user_id], description: params[:expense][:description], amount: params[:expense][:amount], date_time: params[:expense][:date_time])
    if expense.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @user = User.find_by(id: params[:user_id])

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "expenses" SET "description" = $1, "amount" = $2, "date_time" = $3, "updated_at" = $4 WHERE "expenses"."id" = $5  [["description", "test"], ["amount", nil], ["date_time", nil], ["updated_at", 2017-04-29 01:17:08 UTC], ["id", 8]]
---
  def update
    @expense = Expense.find_by(id: params[:id])
    @user = User.find_by(id: params[:user_id])
    if @expense.update(user_id: params[:user_id], description: params[:expense][:description], amount: params[:expense][:amount], date_time: params[:expense][:date_time])