app/controllers/reports_controller.rb

SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = $1  [["user_id", 1]]
INSERT INTO "reports" ("user_id", "start_date", "end_date", "total", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    expenses = Expense.where(user_id: params[:user_id])
    report = Report.new(user_id: params[:user_id], start_date: params[:start_date][:date], end_date: params[:end_date][:date], total: calculate_total(expenses))

    redirect_to current_user if report.save