app/controllers/users_controller.rb

  def show
    @user = User.find_by(id: params[:id])
    if @user.blank? || current_user.id != @user.id
      redirect_to current_user
    else
      @user_expenses = @user.expenses
      @all_expenses = Expense.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "expenses".* FROM "expenses" WHERE "expenses"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]